{"id": "5356e3895db8-0", "pageContent": "Overview of Family Leave Laws in the United States\nPlease note that these paid sick time materials do not represent an exhaustive overview of the state, county, and city family leave laws described, and it does not constitute legal advice.\nIt is possible that additional provisions not described in these materials may apply to a worker’s specific circumstances or category of employment.\nWashington Rhode Island Oregon\nFor more information visit A Better Balance (ABetterBalance.org)\nWhat purposes can leave be used for? Medical leave can be used for a worker’s own serious health condition. Medical leave can be used for a worker’s own serious health condition. Medical leave can be used for a worker’s own serious health condition.\nFamily leave can be used (1) to bond with a child within one year of the child’s Family leave can be used (1) to bond with a child within one year of the child’s Family leave can be used (1) to bond with a child within one year of the child’s\nbirth or placement; (2) to care for a family member with a serious health birth or placement; (2) to care for a family member with a serious health birth or placement; (2) to care for a family member with a serious health\ncondition; (3) to address certain military family needs; or (4) follow-ing the death condition; (3) to address certain military family needs; or (4) follow-ing the death condition; (3) to address certain military family needs; or (4) follow-ing the death\nof a child in certain circumstances. of a child in certain circumstances. of a child in certain circumstances.\nSpecifically, family leave can be taken “[d]uring the seven calendar days following Specifically, family leave can be taken “[d]uring the seven calendar days following Specifically, family leave can be taken “[d]uring the seven calendar days following", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-1", "pageContent": "the death of the family member for whom the employee: (i) [w]ould have qualified the death of the family member for whom the employee: (i) [w]ould have qualified the death of the family member for whom the employee: (i) [w]ould have qualified\nfor medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for for medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for for medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for\nfamily leave” to bond with a child within one year of the child’s birth or family leave” to bond with a child within one year of the child’s birth or family leave” to bond with a child within one year of the child’s birth or\nplacement. placement. placement.\nWho is covered? California, New Jersey, Rhode Island, All employees are covered. All employees are covered. All employees are covered.\nWashington State, Massachusetts, and Connecticut also provide\nsome coverage for previously covered workers who have a qualifying\nneed for family or medical leave while they are unemployed, while\nNew York and Hawaii also provide some coverage for previously\ncovered workers who have a qualifying need related to the worker’s\nown health. Details vary by state. States that aren’t currently\nimplementing their programs will also likely provide some coverage\nfor previously covered workers during unemployment, though final\nregulations will be needed to specify details\nAre public sector workers automatically covered? Note Yes. Yes. Yes.\nthat no state law covers federal employees.\nAre domestic workers covered? Yes. Yes. Yes.\nCan self-employed workers opt-in to coverage? Yes. Yes. Yes.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-2", "pageContent": "Can self-employed workers opt-in to coverage? Yes. Yes. Yes.\nFrom July 1, 2024 through December 31, 2028, drivers at Transportation Network From July 1, 2024 through December 31, 2028, drivers at Transportation Network From July 1, 2024 through December 31, 2028, drivers at Transportation Network\nCompanies (TNCs) who have opted in to the state paid family and medical leave Companies (TNCs) who have opted in to the state paid family and medical leave Companies (TNCs) who have opted in to the state paid family and medical leave\nprogram for both family and medical leave may be entitled to have their program for both family and medical leave may be entitled to have their program for both family and medical leave may be entitled to have their\npremiums reimbursed by their TNC company. premiums reimbursed by their TNC company. premiums reimbursed by their TNC company.\nWhat are the requirements to qualify for benefits? Workers must have worked at least 820 hours in the qualifying period. Workers must have worked at least 820 hours in the qualifying period. Workers must have worked at least 820 hours in the qualifying period.\nThe qualifying period means the first 4 of the 5 most recently completed quarters The qualifying period means the first 4 of the 5 most recently completed quarters The qualifying period means the first 4 of the 5 most recently completed quarters\nor the 4 most recent completed quarters. or the 4 most recent completed quarters. or the 4 most recent completed quarters.\nThis can combine hours worked at more than one employer. This can combine hours worked at more than one employer. This can combine hours worked at more than one employer.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-3", "pageContent": "What family members are covered? A family member includes a worker’s child, child’s spouse or domestic partner, A family member includes a worker’s child, child’s spouse or domestic partner, A family member includes a worker’s child, child’s spouse or domestic partner,\ngrandchild, grandparent, parent, parent-in-law or parent of the worker’s grandchild, grandparent, parent, parent-in-law or parent of the worker’s grandchild, grandparent, parent, parent-in-law or parent of the worker’s\nregistered domestic partner, sibling, spouse, registered domestic partner, any registered domestic partner, sibling, spouse, registered domestic partner, any registered domestic partner, sibling, spouse, registered domestic partner, any\nindividual who regularly resides in a worker’s home where there is an expectation individual who regularly resides in a worker’s home where there is an expectation individual who regularly resides in a worker’s home where there is an expectation\nthat the worker care for the individual, or any individual where the relationship that the worker care for the individual, or any individual where the relationship that the worker care for the individual, or any individual where the relationship\ncreates the expectation that the worker care for the individual and that individual creates the expectation that the worker care for the individual and that individual creates the expectation that the worker care for the individual and that individual\ndepends on the worker for care. depends on the worker for care. depends on the worker for care. Washington Rhode Island Oregon\nFor more information visit A Better Balance (ABetterBalance.org)\nHow is the program funded? Workers and employers share the cost of medical leave. Employers can withhold Workers and employers share the cost of medical leave. Employers can withhold Workers and employers share the cost of medical leave. Employers can withhold", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-4", "pageContent": "up to 45% of the premium from workers’ wages; employers cover the remaining up to 45% of the premium from workers’ wages; employers cover the remaining up to 45% of the premium from workers’ wages; employers cover the remaining\ncost. cost. cost.\nA self-employed individual who elects coverage is only required to pay the portion A self-employed individual who elects coverage is only required to pay the portion A self-employed individual who elects coverage is only required to pay the portion\nof the premium required from workers. of the premium required from workers. of the premium required from workers.\nEmployers with fewer than 50 employees in Washington State are not required to Employers with fewer than 50 employees in Washington State are not required to Employers with fewer than 50 employees in Washington State are not required to\npay the employer portion. Currently, the total premium for medical leave is about pay the employer portion. Currently, the total premium for medical leave is about pay the employer portion. Currently, the total premium for medical leave is about\n0.38% of wages. 0.38% of wages. 0.38% of wages.\nWorkers cover the full cost of family leave. Currently, the premium is about 0.36% Workers cover the full cost of family leave. Currently, the premium is about 0.36% Workers cover the full cost of family leave. Currently, the premium is about 0.36%\nof wages. of wages. of wages.\nThe initial total premium for both family and medical leave will be set at 0.4% of The initial total premium for both family and medical leave will be set at 0.4% of The initial total premium for both family and medical leave will be set at 0.4% of", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-5", "pageContent": "employees’ wages, one third of which shall be associated with family leave and employees’ wages, one third of which shall be associated with family leave and employees’ wages, one third of which shall be associated with family leave and\ntwo thirds of which shall be associated with medical leave. The state will set the two thirds of which shall be associated with medical leave. The state will set the two thirds of which shall be associated with medical leave. The state will set the\npremium in subsequent years based on a formula set by statute. In addition, the premium in subsequent years based on a formula set by statute. In addition, the premium in subsequent years based on a formula set by statute. In addition, the\nstate will set the maximum wages subject to premium contributions based on the state will set the maximum wages subject to premium contributions based on the state will set the maximum wages subject to premium contributions based on the\nmaximum wages subject to social security taxation. Employers may choose to maximum wages subject to social security taxation. Employers may choose to maximum wages subject to social security taxation. Employers may choose to\ncover all or part of employees’ share of the premium for family and/or medical cover all or part of employees’ share of the premium for family and/or medical cover all or part of employees’ share of the premium for family and/or medical\nleave. leave. leave.\nPremiums do not apply to wages above the Social Security contribution base. Premiums do not apply to wages above the Social Security contribution base. Premiums do not apply to wages above the Social Security contribution base.\nWhat percentage of wages do workers receive? 90% of a worker’s average weekly wage up to an amount equal to 50% of the 90% of a worker’s average weekly wage up to an amount equal to 50% of the 90% of a worker’s average weekly wage up to an amount equal to 50% of the", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-6", "pageContent": "statewide average weekly wage and 50% of a worker’s average weekly wage statewide average weekly wage and 50% of a worker’s average weekly wage statewide average weekly wage and 50% of a worker’s average weekly wage\nabove an amount equal to 50% of the statewide average weekly wage above an amount equal to 50% of the statewide average weekly wage above an amount equal to 50% of the statewide average weekly wage\nWhat is the maximum weekly benefit? 90% of the statewide average weekly wage 90% of the statewide average weekly wage 90% of the statewide average weekly wage\nCurrent: $1,456/week Current: $1,456/week Current: $1,456/week\nFor how long can a worker receive benefits? Own health: Up to 12 weeks in a 52-week period. Own health: Up to 12 weeks in a 52-week period. Own health: Up to 12 weeks in a 52-week period.\nTechnically, workers are entitled to medical leave benefits for up to 12 times their Technically, workers are entitled to medical leave benefits for up to 12 times their Technically, workers are entitled to medical leave benefits for up to 12 times their\ntypical workweek hours. As noted below, medical leave may be extended by an typical workweek hours. As noted below, medical leave may be extended by an typical workweek hours. As noted below, medical leave may be extended by an\nadditional 2 weeks (2 times a worker’s typical workweek hours) if the worker additional 2 weeks (2 times a worker’s typical workweek hours) if the worker additional 2 weeks (2 times a worker’s typical workweek hours) if the worker", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-7", "pageContent": "experiences a serious health condition with a pregnancy that results in incapacity. experiences a serious health condition with a pregnancy that results in incapacity. experiences a serious health condition with a pregnancy that results in incapacity.\nFamily leave: Up to 12 weeks in a 52-week period. Family leave: Up to 12 weeks in a 52-week period. Family leave: Up to 12 weeks in a 52-week period.\nTechnically, workers are entitled to family leave benefits for up to 12 times their Technically, workers are entitled to family leave benefits for up to 12 times their Technically, workers are entitled to family leave benefits for up to 12 times their\ntypical workweek hours. typical workweek hours. typical workweek hours.\nFollowing the death of a child in certain circumstances: During the 7 calendar Following the death of a child in certain circumstances: During the 7 calendar Following the death of a child in certain circumstances: During the 7 calendar\ndays following the death. days following the death. days following the death.\nTotal: Up to 16 weeks in a 52-week period. Total: Up to 16 weeks in a 52-week period. Total: Up to 16 weeks in a 52-week period.\nTechnically, workers are entitled to up to a cumulative 16 times the worker’s Technically, workers are entitled to up to a cumulative 16 times the worker’s Technically, workers are entitled to up to a cumulative 16 times the worker’s\ntypical workweek hours of family and medical leave in a 52-week period or up to a typical workweek hours of family and medical leave in a 52-week period or up to a typical workweek hours of family and medical leave in a 52-week period or up to a", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-8", "pageContent": "cumulative 18 times the worker’s typical workweek hours of family and medical cumulative 18 times the worker’s typical workweek hours of family and medical cumulative 18 times the worker’s typical workweek hours of family and medical\nleave in a 52-week period if the worker experiences a serious health condition leave in a 52-week period if the worker experiences a serious health condition leave in a 52-week period if the worker experiences a serious health condition\nwith a pregnancy that results in incapacity. with a pregnancy that results in incapacity. with a pregnancy that results in incapacity.\nWorkers with certain pregnancy-related health needs may receive up to an Workers with certain pregnancy-related health needs may receive up to an Workers with certain pregnancy-related health needs may receive up to an\nadditional 2 weeks of benefits, which can be combined with other uses up to a additional 2 weeks of benefits, which can be combined with other uses up to a additional 2 weeks of benefits, which can be combined with other uses up to a\ntotal of 18 weeks in a 52-week period. total of 18 weeks in a 52-week period. total of 18 weeks in a 52-week period.\nIs there an unpaid waiting period? Own health other than following the birth of a child and family leave other than Own health other than following the birth of a child and family leave other than Own health other than following the birth of a child and family leave other than\nbonding leave and military family leave: Yes—there is a 7-day unpaid waiting bonding leave and military family leave: Yes—there is a 7-day unpaid waiting bonding leave and military family leave: Yes—there is a 7-day unpaid waiting\nperiod. period. period.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-9", "pageContent": "period. period. period.\nOwn health following the birth of a child, bonding leave, and military family leave: Own health following the birth of a child, bonding leave, and military family leave: Own health following the birth of a child, bonding leave, and military family leave:\nNo. No. No.\nAre workers entitled to have their jobs back when they Yes, but only for workers who meet specific eligibility criteria similar to those for Yes, but only for workers who meet specific eligibility criteria similar to those for Yes, but only for workers who meet specific eligibility criteria similar to those for\nreturn? the FMLA. the FMLA. the FMLA.\nWorkers are entitled to job protection under the state paid family and medical Workers are entitled to job protection under the state paid family and medical Workers are entitled to job protection under the state paid family and medical\nleave law only if they work for an employer with at least 50 employees, have been leave law only if they work for an employer with at least 50 employees, have been leave law only if they work for an employer with at least 50 employees, have been\nemployed by that employer for at least 12 months, and have worked for that employed by that employer for at least 12 months, and have worked for that employed by that employer for at least 12 months, and have worked for that\nemployer for at least 1,250 hours during the 12-month period immediately employer for at least 1,250 hours during the 12-month period immediately employer for at least 1,250 hours during the 12-month period immediately\npreceding leave. A worker entitled to job protection under the law must be preceding leave. A worker entitled to job protection under the law must be preceding leave. A worker entitled to job protection under the law must be", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-10", "pageContent": "restored to the worker’s prior position or “an equivalent position with equivalent restored to the worker’s prior position or “an equivalent position with equivalent restored to the worker’s prior position or “an equivalent position with equivalent\nemployment benefits, pay, and other terms and conditions of employment.” Some employment benefits, pay, and other terms and conditions of employment.” Some employment benefits, pay, and other terms and conditions of employment.” Some\nhighly paid employees may be subject to a very narrow exception. Workers who highly paid employees may be subject to a very narrow exception. Workers who highly paid employees may be subject to a very narrow exception. Workers who\nreceive health insurance through their employers are entitled to continuation of receive health insurance through their employers are entitled to continuation of receive health insurance through their employers are entitled to continuation of\nthose benefits while on leave if their employers would be required to continue those benefits while on leave if their employers would be required to continue those benefits while on leave if their employers would be required to continue\nbenefits under the Family and Medical Leave Act. benefits under the Family and Medical Leave Act. benefits under the Family and Medical Leave Act.\nWorkers may have protections under other laws, such as the FMLA. Workers may have protections under other laws, such as the FMLA. Workers may have protections under other laws, such as the FMLA. Washington Rhode Island Oregon\nFor more information visit A Better Balance (ABetterBalance.org)\nHow is the insurance provided? By default, workers are covered by the state fund. Employers can apply for By default, workers are covered by the state fund. Employers can apply for By default, workers are covered by the state fund. Employers can apply for\napproval of a voluntary plan, which must provide benefits at least equivalent to approval of a voluntary plan, which must provide benefits at least equivalent to approval of a voluntary plan, which must provide benefits at least equivalent to", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-11", "pageContent": "those available through the state. those available through the state. those available through the state.\nStatutory Citation Wash. Rev. Code § 50A.05.005 et seq. Wash. Rev. Code § 50A.05.005 et seq. Wash. Rev. Code § 50A.05.005 et seq. New York New Jersey Minnesota\nFor more information visit A Better Balance (ABetterBalance.org)\nWhat purposes can leave be used for? Medical leave can be used for a worker’s own serious health condition. Medical leave can be used for a worker’s own serious health condition. Medical leave can be used for a worker’s own serious health condition.\nFamily leave can be used (1) to bond with a child within one year of the child’s Family leave can be used (1) to bond with a child within one year of the child’s Family leave can be used (1) to bond with a child within one year of the child’s\nbirth or placement; (2) to care for a family member with a serious health birth or placement; (2) to care for a family member with a serious health birth or placement; (2) to care for a family member with a serious health\ncondition; (3) to address certain military family needs; or (4) follow-ing the death condition; (3) to address certain military family needs; or (4) follow-ing the death condition; (3) to address certain military family needs; or (4) follow-ing the death\nof a child in certain circumstances. of a child in certain circumstances. of a child in certain circumstances.\nSpecifically, family leave can be taken “[d]uring the seven calendar days following Specifically, family leave can be taken “[d]uring the seven calendar days following Specifically, family leave can be taken “[d]uring the seven calendar days following", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-12", "pageContent": "the death of the family member for whom the employee: (i) [w]ould have qualified the death of the family member for whom the employee: (i) [w]ould have qualified the death of the family member for whom the employee: (i) [w]ould have qualified\nfor medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for for medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for for medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for\nfamily leave” to bond with a child within one year of the child’s birth or family leave” to bond with a child within one year of the child’s birth or family leave” to bond with a child within one year of the child’s birth or\nplacement. placement. placement.\nWho is covered? California, New Jersey, Rhode Island, All employees are covered. All employees are covered. All employees are covered.\nWashington State, Massachusetts, and Connecticut also provide\nsome coverage for previously covered workers who have a qualifying\nneed for family or medical leave while they are unemployed, while\nNew York and Hawaii also provide some coverage for previously\ncovered workers who have a qualifying need related to the worker’s\nown health. Details vary by state. States that aren’t currently\nimplementing their programs will also likely provide some coverage\nfor previously covered workers during unemployment, though final\nregulations will be needed to specify details\nAre public sector workers automatically covered? Note Yes. Yes. Yes.\nthat no state law covers federal employees.\nAre domestic workers covered? Yes. Yes. Yes.\nCan self-employed workers opt-in to coverage? Yes. Yes. Yes.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-13", "pageContent": "Can self-employed workers opt-in to coverage? Yes. Yes. Yes.\nFrom July 1, 2024 through December 31, 2028, drivers at Transportation Network From July 1, 2024 through December 31, 2028, drivers at Transportation Network From July 1, 2024 through December 31, 2028, drivers at Transportation Network\nCompanies (TNCs) who have opted in to the state paid family and medical leave Companies (TNCs) who have opted in to the state paid family and medical leave Companies (TNCs) who have opted in to the state paid family and medical leave\nprogram for both family and medical leave may be entitled to have their program for both family and medical leave may be entitled to have their program for both family and medical leave may be entitled to have their\npremiums reimbursed by their TNC company. premiums reimbursed by their TNC company. premiums reimbursed by their TNC company.\nWhat are the requirements to qualify for benefits? Workers must have worked at least 820 hours in the qualifying period. Workers must have worked at least 820 hours in the qualifying period. Workers must have worked at least 820 hours in the qualifying period.\nThe qualifying period means the first 4 of the 5 most recently completed quarters The qualifying period means the first 4 of the 5 most recently completed quarters The qualifying period means the first 4 of the 5 most recently completed quarters\nor the 4 most recent completed quarters. or the 4 most recent completed quarters. or the 4 most recent completed quarters.\nThis can combine hours worked at more than one employer. This can combine hours worked at more than one employer. This can combine hours worked at more than one employer.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-14", "pageContent": "What family members are covered? A family member includes a worker’s child, child’s spouse or domestic partner, A family member includes a worker’s child, child’s spouse or domestic partner, A family member includes a worker’s child, child’s spouse or domestic partner,\ngrandchild, grandparent, parent, parent-in-law or parent of the worker’s grandchild, grandparent, parent, parent-in-law or parent of the worker’s grandchild, grandparent, parent, parent-in-law or parent of the worker’s\nregistered domestic partner, sibling, spouse, registered domestic partner, any registered domestic partner, sibling, spouse, registered domestic partner, any registered domestic partner, sibling, spouse, registered domestic partner, any\nindividual who regularly resides in a worker’s home where there is an expectation individual who regularly resides in a worker’s home where there is an expectation individual who regularly resides in a worker’s home where there is an expectation\nthat the worker care for the individual, or any individual where the relationship that the worker care for the individual, or any individual where the relationship that the worker care for the individual, or any individual where the relationship\ncreates the expectation that the worker care for the individual and that individual creates the expectation that the worker care for the individual and that individual creates the expectation that the worker care for the individual and that individual\ndepends on the worker for care. depends on the worker for care. depends on the worker for care.\nHow is the program funded? Workers and employers share the cost of medical leave. Employers can withhold Workers and employers share the cost of medical leave. Employers can withhold Workers and employers share the cost of medical leave. Employers can withhold\nup to 45% of the premium from workers’ wages; employers cover the remaining up to 45% of the premium from workers’ wages; employers cover the remaining up to 45% of the premium from workers’ wages; employers cover the remaining", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-15", "pageContent": "cost. cost. cost.\nA self-employed individual who elects coverage is only required to pay the portion A self-employed individual who elects coverage is only required to pay the portion A self-employed individual who elects coverage is only required to pay the portion\nof the premium required from workers. of the premium required from workers. of the premium required from workers.\nEmployers with fewer than 50 employees in Washington State are not required to Employers with fewer than 50 employees in Washington State are not required to Employers with fewer than 50 employees in Washington State are not required to\npay the employer portion. Currently, the total premium for medical leave is about pay the employer portion. Currently, the total premium for medical leave is about pay the employer portion. Currently, the total premium for medical leave is about\n0.38% of wages. 0.38% of wages. 0.38% of wages.\nWorkers cover the full cost of family leave. Currently, the premium is about 0.36% Workers cover the full cost of family leave. Currently, the premium is about 0.36% Workers cover the full cost of family leave. Currently, the premium is about 0.36%\nof wages. of wages. of wages.\nThe initial total premium for both family and medical leave will be set at 0.4% of The initial total premium for both family and medical leave will be set at 0.4% of The initial total premium for both family and medical leave will be set at 0.4% of\nemployees’ wages, one third of which shall be associated with family leave and employees’ wages, one third of which shall be associated with family leave and employees’ wages, one third of which shall be associated with family leave and", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-16", "pageContent": "two thirds of which shall be associated with medical leave. The state will set the two thirds of which shall be associated with medical leave. The state will set the two thirds of which shall be associated with medical leave. The state will set the\npremium in subsequent years based on a formula set by statute. In addition, the premium in subsequent years based on a formula set by statute. In addition, the premium in subsequent years based on a formula set by statute. In addition, the\nstate will set the maximum wages subject to premium contributions based on the state will set the maximum wages subject to premium contributions based on the state will set the maximum wages subject to premium contributions based on the\nmaximum wages subject to social security taxation. Employers may choose to maximum wages subject to social security taxation. Employers may choose to maximum wages subject to social security taxation. Employers may choose to\ncover all or part of employees’ share of the premium for family and/or medical cover all or part of employees’ share of the premium for family and/or medical cover all or part of employees’ share of the premium for family and/or medical\nleave. leave. leave.\nPremiums do not apply to wages above the Social Security contribution base. Premiums do not apply to wages above the Social Security contribution base. Premiums do not apply to wages above the Social Security contribution base. New York New Jersey Minnesota\nFor more information visit A Better Balance (ABetterBalance.org)\nWhat percentage of wages do workers receive? 90% of a worker’s average weekly wage up to an amount equal to 50% of the 90% of a worker’s average weekly wage up to an amount equal to 50% of the 90% of a worker’s average weekly wage up to an amount equal to 50% of the", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-17", "pageContent": "statewide average weekly wage and 50% of a worker’s average weekly wage statewide average weekly wage and 50% of a worker’s average weekly wage statewide average weekly wage and 50% of a worker’s average weekly wage\nabove an amount equal to 50% of the statewide average weekly wage above an amount equal to 50% of the statewide average weekly wage above an amount equal to 50% of the statewide average weekly wage\nWhat is the maximum weekly benefit? 90% of the statewide average weekly wage 90% of the statewide average weekly wage 90% of the statewide average weekly wage\nCurrent: $1,456/week Current: $1,456/week Current: $1,456/week\nFor how long can a worker receive benefits? Own health: Up to 12 weeks in a 52-week period. Own health: Up to 12 weeks in a 52-week period. Own health: Up to 12 weeks in a 52-week period.\nTechnically, workers are entitled to medical leave benefits for up to 12 times their Technically, workers are entitled to medical leave benefits for up to 12 times their Technically, workers are entitled to medical leave benefits for up to 12 times their\ntypical workweek hours. As noted below, medical leave may be extended by an typical workweek hours. As noted below, medical leave may be extended by an typical workweek hours. As noted below, medical leave may be extended by an\nadditional 2 weeks (2 times a worker’s typical workweek hours) if the worker additional 2 weeks (2 times a worker’s typical workweek hours) if the worker additional 2 weeks (2 times a worker’s typical workweek hours) if the worker", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-18", "pageContent": "experiences a serious health condition with a pregnancy that results in incapacity. experiences a serious health condition with a pregnancy that results in incapacity. experiences a serious health condition with a pregnancy that results in incapacity.\nFamily leave: Up to 12 weeks in a 52-week period. Family leave: Up to 12 weeks in a 52-week period. Family leave: Up to 12 weeks in a 52-week period.\nTechnically, workers are entitled to family leave benefits for up to 12 times their Technically, workers are entitled to family leave benefits for up to 12 times their Technically, workers are entitled to family leave benefits for up to 12 times their\ntypical workweek hours. typical workweek hours. typical workweek hours.\nFollowing the death of a child in certain circumstances: During the 7 calendar Following the death of a child in certain circumstances: During the 7 calendar Following the death of a child in certain circumstances: During the 7 calendar\ndays following the death. days following the death. days following the death.\nTotal: Up to 16 weeks in a 52-week period. Total: Up to 16 weeks in a 52-week period. Total: Up to 16 weeks in a 52-week period.\nTechnically, workers are entitled to up to a cumulative 16 times the worker’s Technically, workers are entitled to up to a cumulative 16 times the worker’s Technically, workers are entitled to up to a cumulative 16 times the worker’s\ntypical workweek hours of family and medical leave in a 52-week period or up to a typical workweek hours of family and medical leave in a 52-week period or up to a typical workweek hours of family and medical leave in a 52-week period or up to a", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-19", "pageContent": "cumulative 18 times the worker’s typical workweek hours of family and medical cumulative 18 times the worker’s typical workweek hours of family and medical cumulative 18 times the worker’s typical workweek hours of family and medical\nleave in a 52-week period if the worker experiences a serious health condition leave in a 52-week period if the worker experiences a serious health condition leave in a 52-week period if the worker experiences a serious health condition\nwith a pregnancy that results in incapacity. with a pregnancy that results in incapacity. with a pregnancy that results in incapacity.\nWorkers with certain pregnancy-related health needs may receive up to an Workers with certain pregnancy-related health needs may receive up to an Workers with certain pregnancy-related health needs may receive up to an\nadditional 2 weeks of benefits, which can be combined with other uses up to a additional 2 weeks of benefits, which can be combined with other uses up to a additional 2 weeks of benefits, which can be combined with other uses up to a\ntotal of 18 weeks in a 52-week period. total of 18 weeks in a 52-week period. total of 18 weeks in a 52-week period.\nIs there an unpaid waiting period? Own health other than following the birth of a child and family leave other than Own health other than following the birth of a child and family leave other than Own health other than following the birth of a child and family leave other than\nbonding leave and military family leave: Yes—there is a 7-day unpaid waiting bonding leave and military family leave: Yes—there is a 7-day unpaid waiting bonding leave and military family leave: Yes—there is a 7-day unpaid waiting\nperiod. period. period.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-20", "pageContent": "period. period. period.\nOwn health following the birth of a child, bonding leave, and military family leave: Own health following the birth of a child, bonding leave, and military family leave: Own health following the birth of a child, bonding leave, and military family leave:\nNo. No. No.\nAre workers entitled to have their jobs back when they Yes, but only for workers who meet specific eligibility criteria similar to those for Yes, but only for workers who meet specific eligibility criteria similar to those for Yes, but only for workers who meet specific eligibility criteria similar to those for\nreturn? the FMLA. the FMLA. the FMLA.\nWorkers are entitled to job protection under the state paid family and medical Workers are entitled to job protection under the state paid family and medical Workers are entitled to job protection under the state paid family and medical\nleave law only if they work for an employer with at least 50 employees, have been leave law only if they work for an employer with at least 50 employees, have been leave law only if they work for an employer with at least 50 employees, have been\nemployed by that employer for at least 12 months, and have worked for that employed by that employer for at least 12 months, and have worked for that employed by that employer for at least 12 months, and have worked for that\nemployer for at least 1,250 hours during the 12-month period immediately employer for at least 1,250 hours during the 12-month period immediately employer for at least 1,250 hours during the 12-month period immediately\npreceding leave. A worker entitled to job protection under the law must be preceding leave. A worker entitled to job protection under the law must be preceding leave. A worker entitled to job protection under the law must be", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-21", "pageContent": "restored to the worker’s prior position or “an equivalent position with equivalent restored to the worker’s prior position or “an equivalent position with equivalent restored to the worker’s prior position or “an equivalent position with equivalent\nemployment benefits, pay, and other terms and conditions of employment.” Some employment benefits, pay, and other terms and conditions of employment.” Some employment benefits, pay, and other terms and conditions of employment.” Some\nhighly paid employees may be subject to a very narrow exception. Workers who highly paid employees may be subject to a very narrow exception. Workers who highly paid employees may be subject to a very narrow exception. Workers who\nreceive health insurance through their employers are entitled to continuation of receive health insurance through their employers are entitled to continuation of receive health insurance through their employers are entitled to continuation of\nthose benefits while on leave if their employers would be required to continue those benefits while on leave if their employers would be required to continue those benefits while on leave if their employers would be required to continue\nbenefits under the Family and Medical Leave Act. benefits under the Family and Medical Leave Act. benefits under the Family and Medical Leave Act.\nWorkers may have protections under other laws, such as the FMLA. Workers may have protections under other laws, such as the FMLA. Workers may have protections under other laws, such as the FMLA.\nHow is the insurance provided? By default, workers are covered by the state fund. Employers can apply for By default, workers are covered by the state fund. Employers can apply for By default, workers are covered by the state fund. Employers can apply for\napproval of a voluntary plan, which must provide benefits at least equivalent to approval of a voluntary plan, which must provide benefits at least equivalent to approval of a voluntary plan, which must provide benefits at least equivalent to\nthose available through the state. those available through the state. those available through the state.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-22", "pageContent": "those available through the state. those available through the state. those available through the state.\nStatutory Citation Wash. Rev. Code § 50A.05.005 et seq. Wash. Rev. Code § 50A.05.005 et seq. Wash. Rev. Code § 50A.05.005 et seq. Massachusetts Maryland Maine\nFor more information visit A Better Balance (ABetterBalance.org)\nWhat purposes can leave be used for? Medical leave can be used for a worker’s own serious health condition. Medical leave can be used for a worker’s own serious health condition. Medical leave can be used for a worker’s own serious health condition.\nFamily leave can be used (1) to bond with a child within one year of the child’s Family leave can be used (1) to bond with a child within one year of the child’s Family leave can be used (1) to bond with a child within one year of the child’s\nbirth or placement; (2) to care for a family member with a serious health birth or placement; (2) to care for a family member with a serious health birth or placement; (2) to care for a family member with a serious health\ncondition; (3) to address certain military family needs; or (4) follow-ing the death condition; (3) to address certain military family needs; or (4) follow-ing the death condition; (3) to address certain military family needs; or (4) follow-ing the death\nof a child in certain circumstances. of a child in certain circumstances. of a child in certain circumstances.\nSpecifically, family leave can be taken “[d]uring the seven calendar days following Specifically, family leave can be taken “[d]uring the seven calendar days following Specifically, family leave can be taken “[d]uring the seven calendar days following", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-23", "pageContent": "the death of the family member for whom the employee: (i) [w]ould have qualified the death of the family member for whom the employee: (i) [w]ould have qualified the death of the family member for whom the employee: (i) [w]ould have qualified\nfor medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for for medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for for medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for\nfamily leave” to bond with a child within one year of the child’s birth or family leave” to bond with a child within one year of the child’s birth or family leave” to bond with a child within one year of the child’s birth or\nplacement. placement. placement.\nWho is covered? California, New Jersey, Rhode Island, All employees are covered. All employees are covered. All employees are covered.\nWashington State, Massachusetts, and Connecticut also provide\nsome coverage for previously covered workers who have a qualifying\nneed for family or medical leave while they are unemployed, while\nNew York and Hawaii also provide some coverage for previously\ncovered workers who have a qualifying need related to the worker’s\nown health. Details vary by state. States that aren’t currently\nimplementing their programs will also likely provide some coverage\nfor previously covered workers during unemployment, though final\nregulations will be needed to specify details\nAre public sector workers automatically covered? Note Yes. Yes. Yes.\nthat no state law covers federal employees.\nAre domestic workers covered? Yes. Yes. Yes.\nCan self-employed workers opt-in to coverage? Yes. Yes. Yes.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-24", "pageContent": "Can self-employed workers opt-in to coverage? Yes. Yes. Yes.\nFrom July 1, 2024 through December 31, 2028, drivers at Transportation Network From July 1, 2024 through December 31, 2028, drivers at Transportation Network From July 1, 2024 through December 31, 2028, drivers at Transportation Network\nCompanies (TNCs) who have opted in to the state paid family and medical leave Companies (TNCs) who have opted in to the state paid family and medical leave Companies (TNCs) who have opted in to the state paid family and medical leave\nprogram for both family and medical leave may be entitled to have their program for both family and medical leave may be entitled to have their program for both family and medical leave may be entitled to have their\npremiums reimbursed by their TNC company. premiums reimbursed by their TNC company. premiums reimbursed by their TNC company.\nWhat are the requirements to qualify for benefits? Workers must have worked at least 820 hours in the qualifying period. Workers must have worked at least 820 hours in the qualifying period. Workers must have worked at least 820 hours in the qualifying period.\nThe qualifying period means the first 4 of the 5 most recently completed quarters The qualifying period means the first 4 of the 5 most recently completed quarters The qualifying period means the first 4 of the 5 most recently completed quarters\nor the 4 most recent completed quarters. or the 4 most recent completed quarters. or the 4 most recent completed quarters.\nThis can combine hours worked at more than one employer. This can combine hours worked at more than one employer. This can combine hours worked at more than one employer.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-25", "pageContent": "What family members are covered? A family member includes a worker’s child, child’s spouse or domestic partner, A family member includes a worker’s child, child’s spouse or domestic partner, A family member includes a worker’s child, child’s spouse or domestic partner,\ngrandchild, grandparent, parent, parent-in-law or parent of the worker’s grandchild, grandparent, parent, parent-in-law or parent of the worker’s grandchild, grandparent, parent, parent-in-law or parent of the worker’s\nregistered domestic partner, sibling, spouse, registered domestic partner, any registered domestic partner, sibling, spouse, registered domestic partner, any registered domestic partner, sibling, spouse, registered domestic partner, any\nindividual who regularly resides in a worker’s home where there is an expectation individual who regularly resides in a worker’s home where there is an expectation individual who regularly resides in a worker’s home where there is an expectation\nthat the worker care for the individual, or any individual where the relationship that the worker care for the individual, or any individual where the relationship that the worker care for the individual, or any individual where the relationship\ncreates the expectation that the worker care for the individual and that individual creates the expectation that the worker care for the individual and that individual creates the expectation that the worker care for the individual and that individual\ndepends on the worker for care. depends on the worker for care. depends on the worker for care.\nHow is the program funded? Workers and employers share the cost of medical leave. Employers can withhold Workers and employers share the cost of medical leave. Employers can withhold Workers and employers share the cost of medical leave. Employers can withhold\nup to 45% of the premium from workers’ wages; employers cover the remaining up to 45% of the premium from workers’ wages; employers cover the remaining up to 45% of the premium from workers’ wages; employers cover the remaining", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-26", "pageContent": "cost. cost. cost.\nA self-employed individual who elects coverage is only required to pay the portion A self-employed individual who elects coverage is only required to pay the portion A self-employed individual who elects coverage is only required to pay the portion\nof the premium required from workers. of the premium required from workers. of the premium required from workers.\nEmployers with fewer than 50 employees in Washington State are not required to Employers with fewer than 50 employees in Washington State are not required to Employers with fewer than 50 employees in Washington State are not required to\npay the employer portion. Currently, the total premium for medical leave is about pay the employer portion. Currently, the total premium for medical leave is about pay the employer portion. Currently, the total premium for medical leave is about\n0.38% of wages. 0.38% of wages. 0.38% of wages.\nWorkers cover the full cost of family leave. Currently, the premium is about 0.36% Workers cover the full cost of family leave. Currently, the premium is about 0.36% Workers cover the full cost of family leave. Currently, the premium is about 0.36%\nof wages. of wages. of wages.\nThe initial total premium for both family and medical leave will be set at 0.4% of The initial total premium for both family and medical leave will be set at 0.4% of The initial total premium for both family and medical leave will be set at 0.4% of\nemployees’ wages, one third of which shall be associated with family leave and employees’ wages, one third of which shall be associated with family leave and employees’ wages, one third of which shall be associated with family leave and", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-27", "pageContent": "two thirds of which shall be associated with medical leave. The state will set the two thirds of which shall be associated with medical leave. The state will set the two thirds of which shall be associated with medical leave. The state will set the\npremium in subsequent years based on a formula set by statute. In addition, the premium in subsequent years based on a formula set by statute. In addition, the premium in subsequent years based on a formula set by statute. In addition, the\nstate will set the maximum wages subject to premium contributions based on the state will set the maximum wages subject to premium contributions based on the state will set the maximum wages subject to premium contributions based on the\nmaximum wages subject to social security taxation. Employers may choose to maximum wages subject to social security taxation. Employers may choose to maximum wages subject to social security taxation. Employers may choose to\ncover all or part of employees’ share of the premium for family and/or medical cover all or part of employees’ share of the premium for family and/or medical cover all or part of employees’ share of the premium for family and/or medical\nleave. leave. leave.\nPremiums do not apply to wages above the Social Security contribution base. Premiums do not apply to wages above the Social Security contribution base. Premiums do not apply to wages above the Social Security contribution base. Massachusetts Maryland Maine\nFor more information visit A Better Balance (ABetterBalance.org)\nWhat percentage of wages do workers receive? 90% of a worker’s average weekly wage up to an amount equal to 50% of the 90% of a worker’s average weekly wage up to an amount equal to 50% of the 90% of a worker’s average weekly wage up to an amount equal to 50% of the", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-28", "pageContent": "statewide average weekly wage and 50% of a worker’s average weekly wage statewide average weekly wage and 50% of a worker’s average weekly wage statewide average weekly wage and 50% of a worker’s average weekly wage\nabove an amount equal to 50% of the statewide average weekly wage above an amount equal to 50% of the statewide average weekly wage above an amount equal to 50% of the statewide average weekly wage\nWhat is the maximum weekly benefit? 90% of the statewide average weekly wage 90% of the statewide average weekly wage 90% of the statewide average weekly wage\nCurrent: $1,456/week Current: $1,456/week Current: $1,456/week\nFor how long can a worker receive benefits? Own health: Up to 12 weeks in a 52-week period. Own health: Up to 12 weeks in a 52-week period. Own health: Up to 12 weeks in a 52-week period.\nTechnically, workers are entitled to medical leave benefits for up to 12 times their Technically, workers are entitled to medical leave benefits for up to 12 times their Technically, workers are entitled to medical leave benefits for up to 12 times their\ntypical workweek hours. As noted below, medical leave may be extended by an typical workweek hours. As noted below, medical leave may be extended by an typical workweek hours. As noted below, medical leave may be extended by an\nadditional 2 weeks (2 times a worker’s typical workweek hours) if the worker additional 2 weeks (2 times a worker’s typical workweek hours) if the worker additional 2 weeks (2 times a worker’s typical workweek hours) if the worker", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-29", "pageContent": "experiences a serious health condition with a pregnancy that results in incapacity. experiences a serious health condition with a pregnancy that results in incapacity. experiences a serious health condition with a pregnancy that results in incapacity.\nFamily leave: Up to 12 weeks in a 52-week period. Family leave: Up to 12 weeks in a 52-week period. Family leave: Up to 12 weeks in a 52-week period.\nTechnically, workers are entitled to family leave benefits for up to 12 times their Technically, workers are entitled to family leave benefits for up to 12 times their Technically, workers are entitled to family leave benefits for up to 12 times their\ntypical workweek hours. typical workweek hours. typical workweek hours.\nFollowing the death of a child in certain circumstances: During the 7 calendar Following the death of a child in certain circumstances: During the 7 calendar Following the death of a child in certain circumstances: During the 7 calendar\ndays following the death. days following the death. days following the death.\nTotal: Up to 16 weeks in a 52-week period. Total: Up to 16 weeks in a 52-week period. Total: Up to 16 weeks in a 52-week period.\nTechnically, workers are entitled to up to a cumulative 16 times the worker’s Technically, workers are entitled to up to a cumulative 16 times the worker’s Technically, workers are entitled to up to a cumulative 16 times the worker’s\ntypical workweek hours of family and medical leave in a 52-week period or up to a typical workweek hours of family and medical leave in a 52-week period or up to a typical workweek hours of family and medical leave in a 52-week period or up to a", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-30", "pageContent": "cumulative 18 times the worker’s typical workweek hours of family and medical cumulative 18 times the worker’s typical workweek hours of family and medical cumulative 18 times the worker’s typical workweek hours of family and medical\nleave in a 52-week period if the worker experiences a serious health condition leave in a 52-week period if the worker experiences a serious health condition leave in a 52-week period if the worker experiences a serious health condition\nwith a pregnancy that results in incapacity. with a pregnancy that results in incapacity. with a pregnancy that results in incapacity.\nWorkers with certain pregnancy-related health needs may receive up to an Workers with certain pregnancy-related health needs may receive up to an Workers with certain pregnancy-related health needs may receive up to an\nadditional 2 weeks of benefits, which can be combined with other uses up to a additional 2 weeks of benefits, which can be combined with other uses up to a additional 2 weeks of benefits, which can be combined with other uses up to a\ntotal of 18 weeks in a 52-week period. total of 18 weeks in a 52-week period. total of 18 weeks in a 52-week period.\nIs there an unpaid waiting period? Own health other than following the birth of a child and family leave other than Own health other than following the birth of a child and family leave other than Own health other than following the birth of a child and family leave other than\nbonding leave and military family leave: Yes—there is a 7-day unpaid waiting bonding leave and military family leave: Yes—there is a 7-day unpaid waiting bonding leave and military family leave: Yes—there is a 7-day unpaid waiting\nperiod. period. period.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-31", "pageContent": "period. period. period.\nOwn health following the birth of a child, bonding leave, and military family leave: Own health following the birth of a child, bonding leave, and military family leave: Own health following the birth of a child, bonding leave, and military family leave:\nNo. No. No.\nAre workers entitled to have their jobs back when they Yes, but only for workers who meet specific eligibility criteria similar to those for Yes, but only for workers who meet specific eligibility criteria similar to those for Yes, but only for workers who meet specific eligibility criteria similar to those for\nreturn? the FMLA. the FMLA. the FMLA.\nWorkers are entitled to job protection under the state paid family and medical Workers are entitled to job protection under the state paid family and medical Workers are entitled to job protection under the state paid family and medical\nleave law only if they work for an employer with at least 50 employees, have been leave law only if they work for an employer with at least 50 employees, have been leave law only if they work for an employer with at least 50 employees, have been\nemployed by that employer for at least 12 months, and have worked for that employed by that employer for at least 12 months, and have worked for that employed by that employer for at least 12 months, and have worked for that\nemployer for at least 1,250 hours during the 12-month period immediately employer for at least 1,250 hours during the 12-month period immediately employer for at least 1,250 hours during the 12-month period immediately\npreceding leave. A worker entitled to job protection under the law must be preceding leave. A worker entitled to job protection under the law must be preceding leave. A worker entitled to job protection under the law must be", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-32", "pageContent": "restored to the worker’s prior position or “an equivalent position with equivalent restored to the worker’s prior position or “an equivalent position with equivalent restored to the worker’s prior position or “an equivalent position with equivalent\nemployment benefits, pay, and other terms and conditions of employment.” Some employment benefits, pay, and other terms and conditions of employment.” Some employment benefits, pay, and other terms and conditions of employment.” Some\nhighly paid employees may be subject to a very narrow exception. Workers who highly paid employees may be subject to a very narrow exception. Workers who highly paid employees may be subject to a very narrow exception. Workers who\nreceive health insurance through their employers are entitled to continuation of receive health insurance through their employers are entitled to continuation of receive health insurance through their employers are entitled to continuation of\nthose benefits while on leave if their employers would be required to continue those benefits while on leave if their employers would be required to continue those benefits while on leave if their employers would be required to continue\nbenefits under the Family and Medical Leave Act. benefits under the Family and Medical Leave Act. benefits under the Family and Medical Leave Act.\nWorkers may have protections under other laws, such as the FMLA. Workers may have protections under other laws, such as the FMLA. Workers may have protections under other laws, such as the FMLA.\nHow is the insurance provided? By default, workers are covered by the state fund. Employers can apply for By default, workers are covered by the state fund. Employers can apply for By default, workers are covered by the state fund. Employers can apply for\napproval of a voluntary plan, which must provide benefits at least equivalent to approval of a voluntary plan, which must provide benefits at least equivalent to approval of a voluntary plan, which must provide benefits at least equivalent to\nthose available through the state. those available through the state. those available through the state.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-33", "pageContent": "those available through the state. those available through the state. those available through the state.\nStatutory Citation Wash. Rev. Code § 50A.05.005 et seq. Wash. Rev. Code § 50A.05.005 et seq. Wash. Rev. Code § 50A.05.005 et seq. District of Columbia Delaware Connecticut\nFor more information visit A Better Balance (ABetterBalance.org)\nWhat purposes can leave be used for? Medical leave can be used for a worker’s own serious health condition. Medical leave can be used for a worker’s own serious health condition. Medical leave can be used for a worker’s own serious health condition.\nFamily leave can be used (1) to bond with a child within one year of the child’s Family leave can be used (1) to bond with a child within one year of the child’s Family leave can be used (1) to bond with a child within one year of the child’s\nbirth or placement; (2) to care for a family member with a serious health birth or placement; (2) to care for a family member with a serious health birth or placement; (2) to care for a family member with a serious health\ncondition; (3) to address certain military family needs; or (4) follow-ing the death condition; (3) to address certain military family needs; or (4) follow-ing the death condition; (3) to address certain military family needs; or (4) follow-ing the death\nof a child in certain circumstances. of a child in certain circumstances. of a child in certain circumstances.\nSpecifically, family leave can be taken “[d]uring the seven calendar days following Specifically, family leave can be taken “[d]uring the seven calendar days following Specifically, family leave can be taken “[d]uring the seven calendar days following", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-34", "pageContent": "the death of the family member for whom the employee: (i) [w]ould have qualified the death of the family member for whom the employee: (i) [w]ould have qualified the death of the family member for whom the employee: (i) [w]ould have qualified\nfor medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for for medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for for medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for\nfamily leave” to bond with a child within one year of the child’s birth or family leave” to bond with a child within one year of the child’s birth or family leave” to bond with a child within one year of the child’s birth or\nplacement. placement. placement.\nWho is covered? California, New Jersey, Rhode Island, All employees are covered. All employees are covered. All employees are covered.\nWashington State, Massachusetts, and Connecticut also provide\nsome coverage for previously covered workers who have a qualifying\nneed for family or medical leave while they are unemployed, while\nNew York and Hawaii also provide some coverage for previously\ncovered workers who have a qualifying need related to the worker’s\nown health. Details vary by state. States that aren’t currently\nimplementing their programs will also likely provide some coverage\nfor previously covered workers during unemployment, though final\nregulations will be needed to specify details\nAre public sector workers automatically covered? Note Yes. Yes. Yes.\nthat no state law covers federal employees.\nAre domestic workers covered? Yes. Yes. Yes.\nCan self-employed workers opt-in to coverage? Yes. Yes. Yes.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-35", "pageContent": "Can self-employed workers opt-in to coverage? Yes. Yes. Yes.\nFrom July 1, 2024 through December 31, 2028, drivers at Transportation Network From July 1, 2024 through December 31, 2028, drivers at Transportation Network From July 1, 2024 through December 31, 2028, drivers at Transportation Network\nCompanies (TNCs) who have opted in to the state paid family and medical leave Companies (TNCs) who have opted in to the state paid family and medical leave Companies (TNCs) who have opted in to the state paid family and medical leave\nprogram for both family and medical leave may be entitled to have their program for both family and medical leave may be entitled to have their program for both family and medical leave may be entitled to have their\npremiums reimbursed by their TNC company. premiums reimbursed by their TNC company. premiums reimbursed by their TNC company.\nWhat are the requirements to qualify for benefits? Workers must have worked at least 820 hours in the qualifying period. Workers must have worked at least 820 hours in the qualifying period. Workers must have worked at least 820 hours in the qualifying period.\nThe qualifying period means the first 4 of the 5 most recently completed quarters The qualifying period means the first 4 of the 5 most recently completed quarters The qualifying period means the first 4 of the 5 most recently completed quarters\nor the 4 most recent completed quarters. or the 4 most recent completed quarters. or the 4 most recent completed quarters.\nThis can combine hours worked at more than one employer. This can combine hours worked at more than one employer. This can combine hours worked at more than one employer.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-36", "pageContent": "What family members are covered? A family member includes a worker’s child, child’s spouse or domestic partner, A family member includes a worker’s child, child’s spouse or domestic partner, A family member includes a worker’s child, child’s spouse or domestic partner,\ngrandchild, grandparent, parent, parent-in-law or parent of the worker’s grandchild, grandparent, parent, parent-in-law or parent of the worker’s grandchild, grandparent, parent, parent-in-law or parent of the worker’s\nregistered domestic partner, sibling, spouse, registered domestic partner, any registered domestic partner, sibling, spouse, registered domestic partner, any registered domestic partner, sibling, spouse, registered domestic partner, any\nindividual who regularly resides in a worker’s home where there is an expectation individual who regularly resides in a worker’s home where there is an expectation individual who regularly resides in a worker’s home where there is an expectation\nthat the worker care for the individual, or any individual where the relationship that the worker care for the individual, or any individual where the relationship that the worker care for the individual, or any individual where the relationship\ncreates the expectation that the worker care for the individual and that individual creates the expectation that the worker care for the individual and that individual creates the expectation that the worker care for the individual and that individual\ndepends on the worker for care. depends on the worker for care. depends on the worker for care.\nHow is the program funded? Workers and employers share the cost of medical leave. Employers can withhold Workers and employers share the cost of medical leave. Employers can withhold Workers and employers share the cost of medical leave. Employers can withhold\nup to 45% of the premium from workers’ wages; employers cover the remaining up to 45% of the premium from workers’ wages; employers cover the remaining up to 45% of the premium from workers’ wages; employers cover the remaining", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-37", "pageContent": "cost. cost. cost.\nA self-employed individual who elects coverage is only required to pay the portion A self-employed individual who elects coverage is only required to pay the portion A self-employed individual who elects coverage is only required to pay the portion\nof the premium required from workers. of the premium required from workers. of the premium required from workers.\nEmployers with fewer than 50 employees in Washington State are not required to Employers with fewer than 50 employees in Washington State are not required to Employers with fewer than 50 employees in Washington State are not required to\npay the employer portion. Currently, the total premium for medical leave is about pay the employer portion. Currently, the total premium for medical leave is about pay the employer portion. Currently, the total premium for medical leave is about\n0.38% of wages. 0.38% of wages. 0.38% of wages.\nWorkers cover the full cost of family leave. Currently, the premium is about 0.36% Workers cover the full cost of family leave. Currently, the premium is about 0.36% Workers cover the full cost of family leave. Currently, the premium is about 0.36%\nof wages. of wages. of wages.\nThe initial total premium for both family and medical leave will be set at 0.4% of The initial total premium for both family and medical leave will be set at 0.4% of The initial total premium for both family and medical leave will be set at 0.4% of\nemployees’ wages, one third of which shall be associated with family leave and employees’ wages, one third of which shall be associated with family leave and employees’ wages, one third of which shall be associated with family leave and", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-38", "pageContent": "two thirds of which shall be associated with medical leave. The state will set the two thirds of which shall be associated with medical leave. The state will set the two thirds of which shall be associated with medical leave. The state will set the\npremium in subsequent years based on a formula set by statute. In addition, the premium in subsequent years based on a formula set by statute. In addition, the premium in subsequent years based on a formula set by statute. In addition, the\nstate will set the maximum wages subject to premium contributions based on the state will set the maximum wages subject to premium contributions based on the state will set the maximum wages subject to premium contributions based on the\nmaximum wages subject to social security taxation. Employers may choose to maximum wages subject to social security taxation. Employers may choose to maximum wages subject to social security taxation. Employers may choose to\ncover all or part of employees’ share of the premium for family and/or medical cover all or part of employees’ share of the premium for family and/or medical cover all or part of employees’ share of the premium for family and/or medical\nleave. leave. leave.\nPremiums do not apply to wages above the Social Security contribution base. Premiums do not apply to wages above the Social Security contribution base. Premiums do not apply to wages above the Social Security contribution base. District of Columbia Delaware Connecticut\nFor more information visit A Better Balance (ABetterBalance.org)\nWhat percentage of wages do workers receive? 90% of a worker’s average weekly wage up to an amount equal to 50% of the 90% of a worker’s average weekly wage up to an amount equal to 50% of the 90% of a worker’s average weekly wage up to an amount equal to 50% of the", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-39", "pageContent": "statewide average weekly wage and 50% of a worker’s average weekly wage statewide average weekly wage and 50% of a worker’s average weekly wage statewide average weekly wage and 50% of a worker’s average weekly wage\nabove an amount equal to 50% of the statewide average weekly wage above an amount equal to 50% of the statewide average weekly wage above an amount equal to 50% of the statewide average weekly wage\nWhat is the maximum weekly benefit? 90% of the statewide average weekly wage 90% of the statewide average weekly wage 90% of the statewide average weekly wage\nCurrent: $1,456/week Current: $1,456/week Current: $1,456/week\nFor how long can a worker receive benefits? Own health: Up to 12 weeks in a 52-week period. Own health: Up to 12 weeks in a 52-week period. Own health: Up to 12 weeks in a 52-week period.\nTechnically, workers are entitled to medical leave benefits for up to 12 times their Technically, workers are entitled to medical leave benefits for up to 12 times their Technically, workers are entitled to medical leave benefits for up to 12 times their\ntypical workweek hours. As noted below, medical leave may be extended by an typical workweek hours. As noted below, medical leave may be extended by an typical workweek hours. As noted below, medical leave may be extended by an\nadditional 2 weeks (2 times a worker’s typical workweek hours) if the worker additional 2 weeks (2 times a worker’s typical workweek hours) if the worker additional 2 weeks (2 times a worker’s typical workweek hours) if the worker", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-40", "pageContent": "experiences a serious health condition with a pregnancy that results in incapacity. experiences a serious health condition with a pregnancy that results in incapacity. experiences a serious health condition with a pregnancy that results in incapacity.\nFamily leave: Up to 12 weeks in a 52-week period. Family leave: Up to 12 weeks in a 52-week period. Family leave: Up to 12 weeks in a 52-week period.\nTechnically, workers are entitled to family leave benefits for up to 12 times their Technically, workers are entitled to family leave benefits for up to 12 times their Technically, workers are entitled to family leave benefits for up to 12 times their\ntypical workweek hours. typical workweek hours. typical workweek hours.\nFollowing the death of a child in certain circumstances: During the 7 calendar Following the death of a child in certain circumstances: During the 7 calendar Following the death of a child in certain circumstances: During the 7 calendar\ndays following the death. days following the death. days following the death.\nTotal: Up to 16 weeks in a 52-week period. Total: Up to 16 weeks in a 52-week period. Total: Up to 16 weeks in a 52-week period.\nTechnically, workers are entitled to up to a cumulative 16 times the worker’s Technically, workers are entitled to up to a cumulative 16 times the worker’s Technically, workers are entitled to up to a cumulative 16 times the worker’s\ntypical workweek hours of family and medical leave in a 52-week period or up to a typical workweek hours of family and medical leave in a 52-week period or up to a typical workweek hours of family and medical leave in a 52-week period or up to a", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-41", "pageContent": "cumulative 18 times the worker’s typical workweek hours of family and medical cumulative 18 times the worker’s typical workweek hours of family and medical cumulative 18 times the worker’s typical workweek hours of family and medical\nleave in a 52-week period if the worker experiences a serious health condition leave in a 52-week period if the worker experiences a serious health condition leave in a 52-week period if the worker experiences a serious health condition\nwith a pregnancy that results in incapacity. with a pregnancy that results in incapacity. with a pregnancy that results in incapacity.\nWorkers with certain pregnancy-related health needs may receive up to an Workers with certain pregnancy-related health needs may receive up to an Workers with certain pregnancy-related health needs may receive up to an\nadditional 2 weeks of benefits, which can be combined with other uses up to a additional 2 weeks of benefits, which can be combined with other uses up to a additional 2 weeks of benefits, which can be combined with other uses up to a\ntotal of 18 weeks in a 52-week period. total of 18 weeks in a 52-week period. total of 18 weeks in a 52-week period.\nIs there an unpaid waiting period? Own health other than following the birth of a child and family leave other than Own health other than following the birth of a child and family leave other than Own health other than following the birth of a child and family leave other than\nbonding leave and military family leave: Yes—there is a 7-day unpaid waiting bonding leave and military family leave: Yes—there is a 7-day unpaid waiting bonding leave and military family leave: Yes—there is a 7-day unpaid waiting\nperiod. period. period.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-42", "pageContent": "period. period. period.\nOwn health following the birth of a child, bonding leave, and military family leave: Own health following the birth of a child, bonding leave, and military family leave: Own health following the birth of a child, bonding leave, and military family leave:\nNo. No. No.\nAre workers entitled to have their jobs back when they Yes, but only for workers who meet specific eligibility criteria similar to those for Yes, but only for workers who meet specific eligibility criteria similar to those for Yes, but only for workers who meet specific eligibility criteria similar to those for\nreturn? the FMLA. the FMLA. the FMLA.\nWorkers are entitled to job protection under the state paid family and medical Workers are entitled to job protection under the state paid family and medical Workers are entitled to job protection under the state paid family and medical\nleave law only if they work for an employer with at least 50 employees, have been leave law only if they work for an employer with at least 50 employees, have been leave law only if they work for an employer with at least 50 employees, have been\nemployed by that employer for at least 12 months, and have worked for that employed by that employer for at least 12 months, and have worked for that employed by that employer for at least 12 months, and have worked for that\nemployer for at least 1,250 hours during the 12-month period immediately employer for at least 1,250 hours during the 12-month period immediately employer for at least 1,250 hours during the 12-month period immediately\npreceding leave. A worker entitled to job protection under the law must be preceding leave. A worker entitled to job protection under the law must be preceding leave. A worker entitled to job protection under the law must be", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-43", "pageContent": "restored to the worker’s prior position or “an equivalent position with equivalent restored to the worker’s prior position or “an equivalent position with equivalent restored to the worker’s prior position or “an equivalent position with equivalent\nemployment benefits, pay, and other terms and conditions of employment.” Some employment benefits, pay, and other terms and conditions of employment.” Some employment benefits, pay, and other terms and conditions of employment.” Some\nhighly paid employees may be subject to a very narrow exception. Workers who highly paid employees may be subject to a very narrow exception. Workers who highly paid employees may be subject to a very narrow exception. Workers who\nreceive health insurance through their employers are entitled to continuation of receive health insurance through their employers are entitled to continuation of receive health insurance through their employers are entitled to continuation of\nthose benefits while on leave if their employers would be required to continue those benefits while on leave if their employers would be required to continue those benefits while on leave if their employers would be required to continue\nbenefits under the Family and Medical Leave Act. benefits under the Family and Medical Leave Act. benefits under the Family and Medical Leave Act.\nWorkers may have protections under other laws, such as the FMLA. Workers may have protections under other laws, such as the FMLA. Workers may have protections under other laws, such as the FMLA.\nHow is the insurance provided? By default, workers are covered by the state fund. Employers can apply for By default, workers are covered by the state fund. Employers can apply for By default, workers are covered by the state fund. Employers can apply for\napproval of a voluntary plan, which must provide benefits at least equivalent to approval of a voluntary plan, which must provide benefits at least equivalent to approval of a voluntary plan, which must provide benefits at least equivalent to\nthose available through the state. those available through the state. those available through the state.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-44", "pageContent": "those available through the state. those available through the state. those available through the state.\nStatutory Citation Wash. Rev. Code § 50A.05.005 et seq. Wash. Rev. Code § 50A.05.005 et seq. Wash. Rev. Code § 50A.05.005 et seq. Colorado California\nFor more information visit A Better Balance (ABetterBalance.org)\nWhat purposes can leave be used for? Medical leave can be used for a worker’s own serious health condition. Medical leave can be used for a worker’s own serious health condition.\nFamily leave can be used (1) to bond with a child within one year of the child’s Family leave can be used (1) to bond with a child within one year of the child’s\nbirth or placement; (2) to care for a family member with a serious health birth or placement; (2) to care for a family member with a serious health\ncondition; (3) to address certain military family needs; or (4) follow-ing the death condition; (3) to address certain military family needs; or (4) follow-ing the death\nof a child in certain circumstances. of a child in certain circumstances.\nSpecifically, family leave can be taken “[d]uring the seven calendar days following Specifically, family leave can be taken “[d]uring the seven calendar days following\nthe death of the family member for whom the employee: (i) [w]ould have qualified the death of the family member for whom the employee: (i) [w]ould have qualified\nfor medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for for medical leave . . . for the birth or their child; or (ii) [w]ould have qualified for", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-45", "pageContent": "family leave” to bond with a child within one year of the child’s birth or family leave” to bond with a child within one year of the child’s birth or\nplacement. placement.\nWho is covered? California, New Jersey, Rhode Island, All employees are covered. All employees are covered.\nWashington State, Massachusetts, and Connecticut also provide\nsome coverage for previously covered workers who have a qualifying\nneed for family or medical leave while they are unemployed, while\nNew York and Hawaii also provide some coverage for previously\ncovered workers who have a qualifying need related to the worker’s\nown health. Details vary by state. States that aren’t currently\nimplementing their programs will also likely provide some coverage\nfor previously covered workers during unemployment, though final\nregulations will be needed to specify details\nAre public sector workers automatically covered? Note Yes. Yes.\nthat no state law covers federal employees.\nAre domestic workers covered? Yes. Yes.\nCan self-employed workers opt-in to coverage? Yes. Yes.\nFrom July 1, 2024 through December 31, 2028, drivers at Transportation Network From July 1, 2024 through December 31, 2028, drivers at Transportation Network\nCompanies (TNCs) who have opted in to the state paid family and medical leave Companies (TNCs) who have opted in to the state paid family and medical leave\nprogram for both family and medical leave may be entitled to have their program for both family and medical leave may be entitled to have their\npremiums reimbursed by their TNC company. premiums reimbursed by their TNC company.\nWhat are the requirements to qualify for benefits? Workers must have worked at least 820 hours in the qualifying period. Workers must have worked at least 820 hours in the qualifying period.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-46", "pageContent": "The qualifying period means the first 4 of the 5 most recently completed quarters The qualifying period means the first 4 of the 5 most recently completed quarters\nor the 4 most recent completed quarters. or the 4 most recent completed quarters.\nThis can combine hours worked at more than one employer. This can combine hours worked at more than one employer.\nWhat family members are covered? A family member includes a worker’s child, child’s spouse or domestic partner, A family member includes a worker’s child, child’s spouse or domestic partner,\ngrandchild, grandparent, parent, parent-in-law or parent of the worker’s grandchild, grandparent, parent, parent-in-law or parent of the worker’s\nregistered domestic partner, sibling, spouse, registered domestic partner, any registered domestic partner, sibling, spouse, registered domestic partner, any\nindividual who regularly resides in a worker’s home where there is an expectation individual who regularly resides in a worker’s home where there is an expectation\nthat the worker care for the individual, or any individual where the relationship that the worker care for the individual, or any individual where the relationship\ncreates the expectation that the worker care for the individual and that individual creates the expectation that the worker care for the individual and that individual\ndepends on the worker for care. depends on the worker for care. Colorado California\nFor more information visit A Better Balance (ABetterBalance.org)\nHow is the program funded? Workers and employers share the cost of medical leave. Employers can withhold Workers and employers share the cost of medical leave. Employers can withhold\nup to 45% of the premium from workers’ wages; employers cover the remaining up to 45% of the premium from workers’ wages; employers cover the remaining\ncost. cost.\nA self-employed individual who elects coverage is only required to pay the portion A self-employed individual who elects coverage is only required to pay the portion", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-47", "pageContent": "of the premium required from workers. of the premium required from workers.\nEmployers with fewer than 50 employees in Washington State are not required to Employers with fewer than 50 employees in Washington State are not required to\npay the employer portion. Currently, the total premium for medical leave is about pay the employer portion. Currently, the total premium for medical leave is about\n0.38% of wages. 0.38% of wages.\nWorkers cover the full cost of family leave. Currently, the premium is about 0.36% Workers cover the full cost of family leave. Currently, the premium is about 0.36%\nof wages. of wages.\nThe initial total premium for both family and medical leave will be set at 0.4% of The initial total premium for both family and medical leave will be set at 0.4% of\nemployees’ wages, one third of which shall be associated with family leave and employees’ wages, one third of which shall be associated with family leave and\ntwo thirds of which shall be associated with medical leave. The state will set the two thirds of which shall be associated with medical leave. The state will set the\npremium in subsequent years based on a formula set by statute. In addition, the premium in subsequent years based on a formula set by statute. In addition, the\nstate will set the maximum wages subject to premium contributions based on the state will set the maximum wages subject to premium contributions based on the\nmaximum wages subject to social security taxation. Employers may choose to maximum wages subject to social security taxation. Employers may choose to\ncover all or part of employees’ share of the premium for family and/or medical cover all or part of employees’ share of the premium for family and/or medical\nleave. leave.\nPremiums do not apply to wages above the Social Security contribution base. Premiums do not apply to wages above the Social Security contribution base.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-48", "pageContent": "What percentage of wages do workers receive? 90% of a worker’s average weekly wage up to an amount equal to 50% of the 90% of a worker’s average weekly wage up to an amount equal to 50% of the\nstatewide average weekly wage and 50% of a worker’s average weekly wage statewide average weekly wage and 50% of a worker’s average weekly wage\nabove an amount equal to 50% of the statewide average weekly wage above an amount equal to 50% of the statewide average weekly wage\nWhat is the maximum weekly benefit? 90% of the statewide average weekly wage 90% of the statewide average weekly wage\nCurrent: $1,456/week Current: $1,456/week\nFor how long can a worker receive benefits? Own health: Up to 12 weeks in a 52-week period. Own health: Up to 12 weeks in a 52-week period.\nTechnically, workers are entitled to medical leave benefits for up to 12 times their Technically, workers are entitled to medical leave benefits for up to 12 times their\ntypical workweek hours. As noted below, medical leave may be extended by an typical workweek hours. As noted below, medical leave may be extended by an\nadditional 2 weeks (2 times a worker’s typical workweek hours) if the worker additional 2 weeks (2 times a worker’s typical workweek hours) if the worker\nexperiences a serious health condition with a pregnancy that results in incapacity. experiences a serious health condition with a pregnancy that results in incapacity.\nFamily leave: Up to 12 weeks in a 52-week period. Family leave: Up to 12 weeks in a 52-week period.\nTechnically, workers are entitled to family leave benefits for up to 12 times their Technically, workers are entitled to family leave benefits for up to 12 times their", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-49", "pageContent": "typical workweek hours. typical workweek hours.\nFollowing the death of a child in certain circumstances: During the 7 calendar Following the death of a child in certain circumstances: During the 7 calendar\ndays following the death. days following the death.\nTotal: Up to 16 weeks in a 52-week period. Total: Up to 16 weeks in a 52-week period.\nTechnically, workers are entitled to up to a cumulative 16 times the worker’s Technically, workers are entitled to up to a cumulative 16 times the worker’s\ntypical workweek hours of family and medical leave in a 52-week period or up to a typical workweek hours of family and medical leave in a 52-week period or up to a\ncumulative 18 times the worker’s typical workweek hours of family and medical cumulative 18 times the worker’s typical workweek hours of family and medical\nleave in a 52-week period if the worker experiences a serious health condition leave in a 52-week period if the worker experiences a serious health condition\nwith a pregnancy that results in incapacity. with a pregnancy that results in incapacity.\nWorkers with certain pregnancy-related health needs may receive up to an Workers with certain pregnancy-related health needs may receive up to an\nadditional 2 weeks of benefits, which can be combined with other uses up to a additional 2 weeks of benefits, which can be combined with other uses up to a\ntotal of 18 weeks in a 52-week period. total of 18 weeks in a 52-week period. Colorado California\nFor more information visit A Better Balance (ABetterBalance.org)\nIs there an unpaid waiting period? Own health other than following the birth of a child and family leave other than Own health other than following the birth of a child and family leave other than", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-50", "pageContent": "bonding leave and military family leave: Yes—there is a 7-day unpaid waiting bonding leave and military family leave: Yes—there is a 7-day unpaid waiting\nperiod. period.\nOwn health following the birth of a child, bonding leave, and military family leave: Own health following the birth of a child, bonding leave, and military family leave:\nNo. No.\nAre workers entitled to have their jobs back when they Yes, but only for workers who meet specific eligibility criteria similar to those for Yes, but only for workers who meet specific eligibility criteria similar to those for\nreturn? the FMLA. the FMLA.\nWorkers are entitled to job protection under the state paid family and medical Workers are entitled to job protection under the state paid family and medical\nleave law only if they work for an employer with at least 50 employees, have been leave law only if they work for an employer with at least 50 employees, have been\nemployed by that employer for at least 12 months, and have worked for that employed by that employer for at least 12 months, and have worked for that\nemployer for at least 1,250 hours during the 12-month period immediately employer for at least 1,250 hours during the 12-month period immediately\npreceding leave. A worker entitled to job protection under the law must be preceding leave. A worker entitled to job protection under the law must be\nrestored to the worker’s prior position or “an equivalent position with equivalent restored to the worker’s prior position or “an equivalent position with equivalent\nemployment benefits, pay, and other terms and conditions of employment.” Some employment benefits, pay, and other terms and conditions of employment.” Some\nhighly paid employees may be subject to a very narrow exception. Workers who highly paid employees may be subject to a very narrow exception. Workers who", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
{"id": "5356e3895db8-51", "pageContent": "receive health insurance through their employers are entitled to continuation of receive health insurance through their employers are entitled to continuation of\nthose benefits while on leave if their employers would be required to continue those benefits while on leave if their employers would be required to continue\nbenefits under the Family and Medical Leave Act. benefits under the Family and Medical Leave Act.\nWorkers may have protections under other laws, such as the FMLA. Workers may have protections under other laws, such as the FMLA.\nHow is the insurance provided? By default, workers are covered by the state fund. Employers can apply for By default, workers are covered by the state fund. Employers can apply for\napproval of a voluntary plan, which must provide benefits at least equivalent to approval of a voluntary plan, which must provide benefits at least equivalent to\nthose available through the state. those available through the state.\nStatutory Citation Wash. Rev. Code § 50A.05.005 et seq. Wash. Rev. Code § 50A.05.005 et seq.", "metadata": {"txtPath": "pdfs/all-family-leave-laws.pdf"}}
